<?php class tpl_text { 

function text($q) { $u=$q->url; $s=""; $t="";
	switch ($u->page) {
		case "company":
			$t.='<h2>О компании</h2>';
			$t.='<hr>';
			$t.='<div class="text-body">';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст<br>';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст <br>';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст <br>';
			$t.='Текст текст текст текст текст текст текст текст текст<br>';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст<br>';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст <br>';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст <br>';
			$t.='Текст текст текст текст текст текст текст текст текст<br>';
			$t.='</div>';
		break;
		case "service":
			$t.='<h2>Сервис</h2>';
			$t.='<hr>';
			$t.='<div class="text-body">';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст';
			$t.='</div>';
		break;
		case "contacts":
			$t.='<h2>Контакты</h2>';
			$t.='<hr>';
			$t.='<div class="text-body">';
			$t.='Текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст текст';
			$t.='</div>';
		break;
	}
	$s.='<div id="text">';
	$s.=$t;
	$s.='</div>';
	return $s;
}

} ?>
